// 👉 For Loop
#include<iostream>
using namespace std;

int main(){


//  🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i = 1;
      // for(; i <=5; i++)
      //       cout << i;
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i = 1;
      // for(; i <=5;)
      //       cout << ++i;
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i = 1;
      // for(; i <=5;)
      //       cout << i++;
         
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i = 1;
      // for(; ;)
      //    cout << i++;
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i = 1;
      // for(; ;){
      //    cout << i++;
      //    if(i == 10){
      //       break;
      //    }
      // }
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i;
      // for(i=1;i <= sizeof(char);i++){
      //    cout << i;
      // }
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i;
      // for(i=1;i <= sizeof(int);i++){
      //    cout << i;
      // }
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i;
      // for(i=1;i <= sizeof(float);i++){
      //    cout << i;
      // }
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
      // int i;
      // for(i=1;i <= sizeof(double);i++){
      //    cout << i;
      // }
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
//   cout << sizeof(NULL) << endl;
      // int i;
      // for(i=1;i <= sizeof(NULL);i++){
      //    cout << i;
      // }
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
//   cout << sizeof(NULL) << endl;
//   while(sizeof(NULL)){
//       cout << "Suber-IQ" << endl;
//       break;
//   }
// 🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟
//   while(sizeof(NULL)){
//       cout << "Suber-IQ" << endl;
//       continue;
//       break;
//   }


      return 0;
}